app/views/books/_index.html.erb

                  <i class="fas fa-heart"></i>
                  <%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 18]]

                  <i class="far fa-heart"></i>
                  <%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 19]]

            <td>
              コメント件数：<%= book.book_comments.count %>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 18]]