app/controllers/books_controller.rb

SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "title"], ["body", "opinion"], ["user_id", "2"], ["created_at", "2021-11-06 15:26:51.988597"], ["updated_at", "2021-11-06 15:26:51.988597"]]
---
  def create
    @books = Book.all
    @book = Book.new(book_params)
    @book.user_id =current_user.id
    if @book.save