app/models/user.rb

  def already_favorited?(book)
    self.favorites.exists?(book_id: book.id)
---
SELECT  1 AS one FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 2], ["book_id", 18], ["LIMIT", 1]]